#include "global.h"

#include ASSET_SOURCE_EK(overlays/expansion_kit/dd_fault/dd_fault.c)

char D_xk1_80033680[] = "セーブ中です。";

char D_xk1_80033690[] = "ロード中です。";

char D_xk1_800336A0[] = "アクセス中は実行できません。";

char D_xk1_800336C0[] = "名前を変更中です。";

char D_xk1_800336D4[] = "ファイルを削除中です。";

char D_xk1_800336EC[] = "ファイルがありません。";

char D_xk1_80033704[] = "プロテクトをかけています。";

char D_xk1_80033720[] = "プロテクトを解除しています。";

char D_xk1_80033740[] = "プロテクトがかかっています。";

char D_xk1_80033760[] = "コピー中です。";

char D_xk1_80033770[] = "エントリー中です。";

char D_xk1_80033784[] = "クリアしています。";

char D_xk1_80033798[] = "オプションセーブ中です。";

char D_xk1_800337B4[] = "エントリーがありません。";

char* D_xk1_800337D0[] = {
    D_xk1_80033680, D_xk1_80033690, D_xk1_800336A0, D_xk1_800336C0, D_xk1_800336D4, D_xk1_800336EC, D_xk1_80033704,
    D_xk1_80033720, D_xk1_80033740, D_xk1_80033760, D_xk1_80033770, D_xk1_80033784, D_xk1_80033798, D_xk1_800337B4,
};

// (Characters as they appear above)
char D_xk1_80033808[] = "ロド実行名変更ファイル削除テけ解ピオショ";
