#include "global.h"

char D_xk3_80137170[] = "マシン名を入力して下さい";

char D_xk3_8013718C[] = "マシンのデータをセーブして下さい";

char D_xk3_801371B0[] = "同名のファイルに上書きしますか？";

char D_xk3_801371D4[] = "これ以上セーブできません";

char D_xk3_801371F0[] = "いらないファイルを消して下さい";

char D_xk3_80137210[] = "マシンを全て初期状態に戻しますか？";

char D_xk3_80137234[] = "変更できません";

char D_xk3_80137244[] = "セーブできません";

char D_xk3_80137258[] = "画面上のマシンがエントリーされます";

char D_xk3_8013727C[] = "エントリーするマシンを選んで下さい";

char D_xk3_801372A0[] = "を";

char D_xk3_801372A4[] = "クリアしますか？";

char* D_xk3_801372B8[] = {
    D_xk3_80137170, D_xk3_8013718C, D_xk3_801371B0, D_xk3_801371D4, D_xk3_801371F0, D_xk3_80137210,
    D_xk3_80137234, D_xk3_80137244, D_xk3_80137258, D_xk3_8013727C, D_xk3_801372A0, D_xk3_801372A4,
};
